/*Задание 1
Создать html-страницу для ввода имени пользователя.
Необходимо проверять каждый символ, который вводит пользователь. 
Если он ввел цифру, то не отображать ее в input.*/

$(document).ready(function() {
    $('#username').on('input', function(e) {
        let value = $(this).val();
        // Проверяем наличие цифр и удаляем их
        if (/[0-9]/.test(value)) {
            e.preventDefault(); // Предотвращаем вставку цифры
            $(this).val(value.replace(/[0-9]/g, '')); // Удаляем цифры
        }
    });
});
