// Задание
// Запрашивать данные у пользователя необходимо с помощью prompt(), а выводить результат с помощью alert().
// 1. Запросите у пользователя его имя и выведите в ответ: «Привет, его имя!».

let name = prompt('Введите ваше имя');
alert('Привет, ' + name + '!');

// 2. Запросите у пользователя год его рождения, посчитайте, сколько ему лет и выведите результат. 
// Текущий год укажите в коде как константу.

let year = prompt('Введите год вашего рождения');
let currentYear = 2023;
let age = currentYear - year;
alert('Вам '+ age + ' лет');

// 3. Запросите у пользователя длину стороны квадрата и выведите периметр такого квадрата.

let side = prompt('Введите длину стороны квадрата');
let perimeter = side * 4;
alert('Периметр квадрата равен '+ perimeter);

// 4. Запросите у пользователя радиус окружности и выведите площадь такой окружности.

let radius = prompt('Введите радиус окружности');
let area = Math.PI * radius ** 2;
alert('Площадь окружности равна '+ area);

// 5. Запросите у пользователя расстояние в км между двумя городами и за сколько часов он хочет добраться. 
// Посчитайте скорость, с которой необходимо двигаться, чтобы успеть вовремя.

let distance = prompt('Введите расстояние между городами в км');
let time = prompt('Введите время в часах');
let speed = distance / time;
alert('Скорость, с которой необходимо двигаться, чтобы успеть вовремя, равна '+ speed);

// 6. Реализуйте конвертор валют. Пользователь вводит доллары, программа переводит в евро. 
// Курс валюты храните в константе.

const dollar = 0.91;
let dollars = prompt('Введите количество долларов');
let euro = dollars * dollar;
alert('Ваше количество евро '+ euro);

// 7. Пользователь указывает объем флешки в Гб. Программа должна посчитать сколько файлов размером 
// в 820 Мб помещается на флешку.

let flash = prompt('Введите объем флешки в Гб');
let file = 820;
let result = flash * 1024 / file;
alert('На флешку помещается '+ result +' файлов');

// 8. Пользователь вводит сумму денег в кошельке и цену одной шоколадки. 
// Программа выводит сколько шоколадок может купить пользователь и сколько сдачи у него останется.

const money = +prompt('Введите сумму денег в кошельке:');
const pricePerChocolate = +prompt('Введите цену одной шоколадки:');

const chocolates = money // pricePerChocolate;
const change = money % pricePerChocolate;
alert('Пользователь может купить '+ chocolates +' шоколадок и у него останется '+ change +' денег');

// 9. Запросите у пользователя трехзначное число и выведите его задом наперед. 
// Для решения задачи вам понадобится оператор % (остаток от деления).

let number = prompt('Введите трехзначное число');
let firstDigit = number % 10;
let secondDigit = Math.floor(number / 10) % 10;
let thirdDigit = Math.floor(number / 100);
let reversedNumber = firstDigit * 100 + secondDigit * 10 + thirdDigit;
alert('Число задом наперед '+ reversedNumber);

// 10. Запросите у пользователя целое число и выведите в ответ, четное число или нет. 
// В задании используйте логические операторы. В задании не надо использовать if или switch.

let num = prompt('Введите целое число');
let isEven = num % 2 === 0;
alert('Число четное '+ isEven);









